RichardYJ/GE_EFM8LB12F64E-B-QFN32_YJ/GE_EFM8LB12F64E-B-QFN32_YJ/SI/GE_EFM8LB12F64E-B-QFN32_YJ.si4project/Backup/GE_EFM8LB12F64E-B-QFN32_YJ_main(777).c
//-----------------------------------------------------------------------------
// EFM8LB1_SMBus_MasterMultibyte.c
//-----------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
//
// Program Description:
//
// Example software to demonstrate the SMBus interface in Master mode.
// - Interrupt-driven SMBus implementation
// - Only master states defined (no slave or arbitration)
// - multiple-byte SMBus data holders used for each transmit and receive
// - SCL frequency defined by <SMB_FREQUENCY> constant
// - SMB0CN0_ARBLOST support included
// - supports multiple-byte writes and multiple-byte reads
//
// Resources:
//   SYSCLK - 24.5 MHz HFOSC0 / 1
//   SMBus  - SMBus master, SCL = 10 kHz
//   Timer1 - SMBus clock source
//   Timer3 - SMBus SCL low timeout detection
//   P0.0   - SMBus SDA
//   P0.1   - SMBus SCL
//   P1.4   - LED green
//   P3.4   - Display enable
//
//-----------------------------------------------------------------------------
// How To Test: EFM8LB1 STK (SMBus Master) + EFM8LB1 STK (SMBus Slave)
//-----------------------------------------------------------------------------
// 1) Connect the device first EFM8LB1 STK to second EFM8LB1 STK running the
//    corresponding SMBus_Slave code.
// 2) Place the switch in "AEM" mode.
// 3) Connect the EFM8LB1 STK board to a PC using a mini USB cable.
// 4) Compile and download code to the first EFM8LB1 STK board.
//    In Simplicity Studio IDE, select Run -> Debug from the menu bar,
//    click the Debug button in the quick menu, or press F11.
// 5) Run the code.
//    In Simplicity Studio IDE, select Run -> Resume from the menu bar,
//    click the Resume button in the quick menu, or press F8.
// 6) a. The test will indicate proper communication with the slave by
//       toggling LED1 on and off each time a value is sent and received.
//    b. The best method to view the proper functionality is to run to
//       the indicated line of code in the TEST CODE section of main and
//       view the SMB_DATA_IN and SMB_DATA_OUT variables in the Watch
//       Window.
//
// Target:         EFM8LB1
// Tool chain:     Generic
//
// Release 0.1 (ST)
//    - Initial Revision
//    - 06 MAR 2015
//

//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------
#include <SI_EFM8LB1_Register_Enums.h>
#include "InitDevice.h"
#include "EFM8LB1_SMBus_MasterMultibyte.h"

//-----------------------------------------------------------------------------
// Global Variables
//-----------------------------------------------------------------------------
// Global holder for SMBus data
// All receive data is written here
uint8_t SMB_DATA_IN[NUM_BYTES_RD];

// Global holder for SMBus data.
// All transmit data is read from here
uint8_t SMB_DATA_OUT[NUM_BYTES_WR];

uint8_t TARGET;                        // Target SMBus slave address

volatile bool SMB_BUSY;                 // Software flag to indicate when the
                                       // SMB_Read() or SMB_Write() functions
                                       // have claimed the SMBus

volatile bool SMB_RW;                   // Software flag to indicate the
                                       // direction of the current transfer

uint16_t NUM_ERRORS;                   // Counter for the number of errors.
uint8_t nWR;

//-----------------------------------------------------------------------------
// Function Prototypes
//-----------------------------------------------------------------------------
void SMB_Write(void);
void SMB_Read(void);
void T0_Waitms(uint8_t ms);

bool SMB0_I2C_MasterWrite(uint16_t RegAddr, uint16_t RegValue) {
	nWR = 4;
	TARGET = SLAVE_ADDR;			 // Target the Slave for next SMBus
	SMB_DATA_OUT[0] = (RegAddr >> 8) & 0xff;
	SMB_DATA_OUT[1] = RegAddr&0xff;
	SMB_DATA_OUT[2] = (RegValue >> 8) & 0xff;
	SMB_DATA_OUT[3] = RegValue&0xff;
//	SMB_DATA_OUT[3] = ((RegValue >> 8) & 0xff);
//	SMB_DATA_OUT[2] = (RegValue);
	SMB_Write();					 // Initiate SMBus write
	return 1;
}

uint16_t SMB0_I2C_MasterRead(uint16_t RegAddr) {
	uint16_t sRes;
	nWR = 2;
	TARGET = SLAVE_ADDR;			 // Target the Slave for next SMBus
	SMB_DATA_OUT[0] = (RegAddr >> 8) & 0xff;
	SMB_DATA_OUT[1] = RegAddr&0xff;
	SMB_Write();					 // Initiate SMBus write
	TARGET = SLAVE_ADDR;
	SMB_Read();
	sRes = (SMB_DATA_IN[0] << 8) & 0xff00 | SMB_DATA_IN[1] & 0xff;
//	sRes = SMB_DATA_IN[0] << 8 | SMB_DATA_IN[1];
	return sRes;
}



//-----------------------------------------------------------------------------
// SiLabs_Startup() Routine
// ----------------------------------------------------------------------------
// This function is called immediately after reset, before the initialization
// code is run in SILABS_STARTUP.A51 (which runs before main() ). This is a
// useful place to disable the watchdog timer, which is enable by default
// and may trigger before main() in some instances.
//-----------------------------------------------------------------------------
void SiLabs_Startup (void)
{
  // Disable the watchdog here
}
 
//-----------------------------------------------------------------------------
// Main Routine
//-----------------------------------------------------------------------------
//
// Main routine performs all configuration tasks, then loops forever sending
// and receiving SMBus data to the slave.
//
//-----------------------------------------------------------------------------
void main (void)
{
   volatile uint8_t dat;               // Test counter
   volatile uint8_t data_count;        // SMB_DATA_IN and SMB_DATA_OUT counter
   uint16_t i;                          // Dummy variable counters
   volatile uint16_t sI2C_rd;

   enter_BusFreeMode_from_RESET();

   DISP_EN = DISP_BC_DRIVEN;           // EFM8 does not drive display

   // If slave is holding SDA low because of an improper SMBus reset or error
   while(!SDA)
   {
      // Provide clock pulses to allow the slave to advance out
      // of its current state. This will allow it to release SDA.
      XBR2 = XBR2_XBARE__ENABLED;      // Enable Crossbar
      SCL = 0;                         // Drive the clock low
      for(i = 0; i < 255; i++);        // Hold the clock low
      SCL = 1;                         // Release the clock
      while(!SCL);                     // Wait for open-drain
                                       // clock output to rise
      for(i = 0; i < 10; i++);         // Hold the clock high
      XBR2 = XBR2_XBARE__DISABLED;     // Disable Crossbar
   }

   enter_DefaultMode_from_BusFreeMode();

   LED1 = LED_OFF;

   // TEST CODE----------------------------------------------------------------

   dat = 0;                            // Output data counter
   NUM_ERRORS = 0;                     // Error counter

   while (1)
   {
#if 0   
      // SMBus Write Sequence
#if 0
      for (data_count = 0; data_count < NUM_BYTES_WR; data_count++)
      {
         SMB_DATA_OUT[data_count] = dat; // Define next outgoing byte
         dat++;
      }
#else
      SMB_DATA_OUT[0]=0x98;
      SMB_DATA_OUT[1]=0x11;
      SMB_DATA_OUT[2]=0xab;
      SMB_DATA_OUT[3]=0xcd;
      #endif
      TARGET = SLAVE_ADDR;             // Target the Slave for next SMBus
                                       // transfer
      SMB_Write();                     // Initiate SMBus write

      // SMBus Read Sequence
      TARGET = SLAVE_ADDR;             // Target the Slave for next SMBus
                                       // transfer
//      SMB_Read();

      // Check transfer data
      for (data_count = 0; data_count < NUM_BYTES_RD; data_count++)
      {
         // Received data match transmit data?
         if (SMB_DATA_IN[data_count] != SMB_DATA_OUT[data_count])
         {
            NUM_ERRORS++;              // Increment error counter if no
                                       // match
         }
      }
#if 0
      // Indicate that an error has occurred (LED no longer lit)
      if (NUM_ERRORS > 0)
      {
         LED1 = LED_OFF;
      }
      else
#endif
#else
		for (i = 0; i < 255; i++) 
		{
#if 1		
			sI2C_rd = SMB0_I2C_MasterRead(0x00);
			SMB0_I2C_MasterWrite(0x9811, 0xabcd/*i*/);

//			if (0x204c != sI2C_rd)
			for(i=0;i<32768;i++);
			LED1 = !LED1;
//				printf(					"SMB0_I2C    ===============Read================== 0x0 ============Error!!!->0x%02X \r\n ",					sI2C_rd);
//			else
//			printf("SMB0_I2C Read 0x0 OK  !\r\n");
#endif
//			if (1 == SMB0_I2C_MasterWrite(0x9811, 0xabcd/*i*/)) {
//				sI2C_rd = SMB0_I2C_MasterRead(0x9811);
//				if (i != sI2C_rd)
//					LED1 = !LED1;
//					printf(						"SMB0_I2C ================Write========================= 0x9811 ============Error!!!\r\n");
//				else {
//					LED1 = !LED1;
//					printf("SMB0_I2C Write & Read 0x9811 OK !\r\n");
//				}
		}


#endif
      {
//         LED1 = !LED1;
      }

      // Run to here to view the SMB_DATA_IN and SMB_DATA_OUT variable arrays

      T0_Waitms (50);                  // Wait 50 ms until the next cycle
                                       // so that LED blinks slow enough to see
   }

   // END TEST CODE------------------------------------------------------------

}

//-----------------------------------------------------------------------------
// Support Functions
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// SMB_Write
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// Writes a single byte to the slave with address specified by the <TARGET>
// variable.
// Calling sequence:
// 1) Write target slave address to the <TARGET> variable
// 2) Write outgoing data to the <SMB_DATA_OUT> variable array
// 3) Call SMB_Write()
//
//-----------------------------------------------------------------------------
void SMB_Write(void)
{
   while(SMB_BUSY);                    // Wait for SMBus to be free.
   SMB_BUSY = 1;                       // Claim SMBus (set to busy)
   SMB_RW = 0;                         // Mark this transfer as a WRITE
   SMB0CN0_STA = 1;                    // Start transfer
}

//-----------------------------------------------------------------------------
// SMB_Read
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   : None
//
// Reads a single byte from the slave with address specified by the <TARGET>
// variable.
// Calling sequence:
// 1) Write target slave address to the <TARGET> variable
// 2) Call SMB_Write()
// 3) Read input data from <SMB_DATA_IN> variable array
//
//-----------------------------------------------------------------------------
void SMB_Read(void)
{
   while(SMB_BUSY);                    // Wait for bus to be free.
   SMB_BUSY = 1;                       // Claim SMBus (set to busy)
   SMB_RW = 1;                         // Mark this transfer as a READ

   SMB0CN0_STA = 1;                    // Start transfer

   while(SMB_BUSY);                    // Wait for transfer to complete
}

//-----------------------------------------------------------------------------
// T0_Waitms
//-----------------------------------------------------------------------------
//
// Return Value : None
// Parameters   :
//   1) uint8_t ms - number of milliseconds to wait
//                        range is full range of character: 0 to 255
//
// Configure Timer0 to wait for <ms> milliseconds using SYSCLK as its time
// base.
//
//-----------------------------------------------------------------------------
void T0_Waitms(uint8_t ms)
{
   TCON &= ~0x30;                      // Stop Timer0; Clear TCON_TF0
   TMOD &= ~0x0f;                      // 16-bit free run mode
   TMOD |=  0x01;

   CKCON0 |= 0x04;                     // Timer0 counts SYSCLKs

   while (ms)
   {
      TCON_TR0 = 0;                    // Stop Timer0
      TH0 = ((-SYSCLK/1000) >> 8);     // Overflow in 1ms
      TL0 = ((-SYSCLK/1000) & 0xFF);
      TCON_TF0 = 0;                    // Clear overflow indicator
      TCON_TR0 = 1;                    // Start Timer0
      while (!TCON_TF0);               // Wait for overflow
      ms--;                            // Update ms counter
   }

   TCON_TR0 = 0;                       // Stop Timer0
}

